
/*******************************************************
 *
 * @FileName: tax.h
 * @Date: 2023-05-24 16:06:26
 * @Author: ccy
 * @Description: TAX通信模块头文件.
 *
 * Copyright (c) 2023 by thinker, All Rights Reserved.
 *
 *******************************************************/

#ifndef SERIAL_H_
#define SERIAL_H_

/*******************************************************
 * 头文件
 *******************************************************/

#include "type.h"

/*******************************************************
 * 宏定义
 *******************************************************/

#define IN_BEGIN 0x8B  /* 收话开始 */
#define IN_END 0x8C    /* 收话结束 */
#define OUT_BEGIN 0x89 /* 发话开始 */
#define OUT_END 0x8A   /* 发话结束 */

/*******************************************************
 * 函数声明
 *******************************************************/

/*******************************************************
 *
 * @brief  发送TAX2应答事件
 *
 * @param  Event: 事件代号
 * @param  *tax40: 当前TAX数据指针
 * @retval 0:成功 -1:失败
 *
 *******************************************************/
sint32_t tax_send_echo_event(uint8_t Event, const tax40_t *tax40);

/*******************************************************
 *
 * @brief  tax模块初始化函数
 *
 * @param  *list: 提示音播放列表的数据指针
 * @retval sint32_t  0:成功 <0:失败
 *
 *******************************************************/
sint32_t tax_init(void);

#endif
