
/*******************************************************
 *
 * @FileName: usb.h
 * @Date: 2023-05-24 16:06:26
 * @Author: ccy
 * @Description: USB转储模块头文件.
 *
 * Copyright (c) 2023 by thinker, All Rights Reserved.
 *
 *******************************************************/

#ifndef _USB_H_
#define _USB_H_

/*******************************************************
 * 头文件
 *******************************************************/

#include "type.h"

/*******************************************************
 * 宏定义
 *******************************************************/

/* 存储U盘ID的文件 */
#define UDISK_ID_PATH "/proc/udisk/SerialNumber"
/* 思维验证key的文件 */
#define SW_KEY_FILE_PATH "/mnt/udisk/ud0p0/sw.lib"
/* U盘ID的长度,单位:byte */
#define USB_KEY_MAX_LEN 64

/*只复制文件到U盘 */
#define COPY_MODE_COPY_OLAY 0
/*先复制文件到U盘,再备份文件 */
#define COPY_MODE_COPY_BAK 1

/*******************************************************
 * 函数声明
 *******************************************************/

/*******************************************************
 *
 * @brief 校验U盘的ID是否正确
 *
 * @param  *id: U盘的ID
 * @retval 0:成功 -1:失败
 *
 *******************************************************/
int check_udisk_id(char *id);

/*******************************************************
 *
 * @brief  U盘转储操作
 *
 * @retval int 0:成功 -1:失败
 *
 *******************************************************/
int usb_init(void);

#endif
